
# /  ჩვეულებრივი გაყოფა აბრუნებს ათწილადს
# // მთელზე გაყოფა  აბრუნებს მხოლოდ მთელ რიცხვებს



a = 15
b = 4

print(a + b)
print(a - b)
print(a * b)
print(a / b)
print(a // b)
print(a % b)
print(a ** b)



age = 16
age = age + 35
age = age - 20
age = age * 20
print(age)  


# რა არის Debugging?
# Debugging არის კოდში არსებული შეცდომების bug პოვნის
# ანალიზისა და გასწორების პროცესი რათა პროგრამამ იმუშაოს გამართულად


# გასწორებული კოდი
# შეცდომები ცვლადის სახელი არ შეიძლება იწყებოდეს ციფრით 
# არ შეიძლება შეიცავდეს სპეციალურ სიმბოლოებს (nums$) 
# ბრჭყალები უნდა იყოს დახურული ("777") და ფუნქციის სახელი უნდა იყოს print და არა prin

academy = "GOA"
group = "200"
print(academy)
print(group)